# Final test work IT specialist 

**Итоговая проверочная работа первого блока специальности IT специалист ( GeekBrains ) .**

**Задача:**
            
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

**Примеры:**

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

_____

## Часть 1.

    Задать массив из переменных строчного типа.

*Как и указано в задании задам его "вручную".*

**string[] array = { "Happy", "new",
"year", "and", "merry", 
 "christmas." };**

 ---

 ## Часть 2.
    
    Написать метод для вывода массива в терминал.

*Использую метод типа **void** . Он будет принимать в себя массив типа **string** и выводить значения индексов массива прямо из метода.*

*Использую цикл **for** . Обращаясь к каждому элементу массива по порядку от **0-го** до **array.Length - 1** (количество элементов массива на 1 меньше), выводится по очереди в терминал значения элементов массива с помощью интерполяции строки.*

**Console.Write($"[{array[i]}] ");**

*После завершения цикла оставлю пустую строку для того чтобы следующее действие консоль начала с новой строки.*

**Console.WriteLine();**

*И сразу же запущу метод используя массив записанный ранее.*

**ShowArray(array);**

---
## Часть 3.

    Написать метод для уменьшения симвалов в каждом элементе массива (от 0 до 3 симвалов)

*Использую возвращаемый метод.Возвращать он будет изменённый массив строчного типа **string[]** и принимать в виде аргумента иходный массив так же строчного типа.*

*Создам новый массив так же строчного типа.*

**string[] cutArray = new string[array.Length];**

*Обьявлю переменную для хранения значения от 0 до 3(количество симвалов в строке). Для каждого элемента массива эта переменная будет меняться.Буду использовать генератор случайных чисел.*

**int length = 0;**

*Для правки всех элементов массива буду использовать цикл **for** . При каждой итерации цикла будет генерироваться случайное число в переменную **length**.*

**length = new Random().Next(0, 4);** // 0 1 2 3

*Внутри цикла **for** буду использовать ещё один оператор циклирования **while** , в катором будет уменьшаться на один символ текущего элемента массива до тех пор пока колчество значений текущего элемента массива не станет равным **length**.*

**while (array[i].Length > length)**
    
    array[i] = array[i].Remove(0, 1);

**Remove(0, 1)** *Встроеный оператор для уданеия симвала из строки*

*В случае если условие **while** станет "отрицательным" перепишу изменённый элемент в массива в новый массив **cutArray**. Так как массивы имеют одинаковое количество элементов и для правки и для перезаписи использую один цикл **for**.*

**cutArray[i] = array[i];**

*На этом завершитсятся одна итерация цикла **for**.
После того как счётчик пройдёт по всем элементам массива , верну заполненый массив **cutArray** .*

**return cutArray;**

---

